from data_types import *

# test data
audiences_list = [
    AudienceInfo("13241", "Университетский проспект, дом 35", "Лекционный зал", "202"),
    AudienceInfo("16542", "Университетский проспект, дом 35", "Лекционный зал", "210"),
    AudienceInfo("16763", "Университетский проспект, дом 35", "Лекционный зал", "204"),
    AudienceInfo("87654", "Университетский проспект, дом 35", "Лекционный зал", "208"),

    AudienceInfo("98765", "Университетский проспект, дом 35", "Кабинет", "215"),
    AudienceInfo("43567", "Университетский проспект, дом 35", "Кабинет", "279"),
    AudienceInfo("97685", "Университетский проспект, дом 35", "Кабинет", "480"),
    AudienceInfo("24378", "Университетский проспект, дом 35", "Кабинет", "303"),

    AudienceInfo("09879", "Университетский проспект, дом 28", "Лекционный зал", "4309"),
    AudienceInfo("24356", "Университетский проспект, дом 28", "Лекционный зал", "4317"),
    AudienceInfo("46734", "Университетский проспект, дом 28", "Лекционный зал", "2103"),
    AudienceInfo("76544", "Университетский проспект, дом 28", "Лекционный зал", "3506"),

    AudienceInfo("23534", "Университетский проспект, дом 28", "Кабинет", "215"),
    AudienceInfo("24636", "Университетский проспект, дом 28", "Кабинет", "279"),
    AudienceInfo("26436", "Университетский проспект, дом 28", "Кабинет", "480"),
    AudienceInfo("68956", "Университетский проспект, дом 28", "Кабинет", "303"),
]


educators_list = [
    EducatorInfo("346346", "Смирнова Элина Марковна", "ПМ-ПУ", "доцент", "кандидат наук"),
    EducatorInfo("346357", "Тарасова Светлана Глебовна", "ПМ-ПУ", "доцент", ""),
    EducatorInfo("784688", "Трифонова Марьям Владиславовна", "ПМ-ПУ", "ассистент", ""),
    EducatorInfo("846858", "Богданов Матвей Львович", "ПМ-ПУ", "ассистент", ""),
    EducatorInfo("165384", "Федосеев Тимофей Даниилович", "ПМ-ПУ", "профессор", "кандидат наук"),
    EducatorInfo("252679", "Калмыков Пётр Артурович", "ПМ-ПУ", "профессор", "доктор наук"),
    EducatorInfo("463563", "Головина Арина Максимовна", "ПМ-ПУ", "профессор", "доктор наук"),
    EducatorInfo("637357", "Андреева Екатерина Григорьевна", "МатМех", "доцент", "кандидат наук"),
    EducatorInfo("246379", "Ларионова Марина Викторовна", "МатМех", "доцент", ""),
    EducatorInfo("235343", "Курочкина Полина Артёмовна", "МатМех", "ассистент", ""),
    EducatorInfo("674574", "Гришина Светлана Кирилловна", "МатМех", "ассистент", ""),
    EducatorInfo("168569", "Анохина Татьяна Артёмовна", "МатМех", "профессор", "доктор наук"),

]