from data_types import *

# test data
audiences_list = [
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "202"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "210"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "204"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "208"),

    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "303"),

    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4309"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4317"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "2103"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "3506"),

    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "303")
]

groups_list = [
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "131", "1"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "232", "2"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "132", "1"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "331", "3"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "134", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "111", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "111", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "311", "3"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "411", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "111", "1"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "211", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "212", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "213", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "311", "3"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "411", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "412", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "214", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "112", "1"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "113", "1")

]


disciplines_list = [
    DisciplineInfo("Алгебра"),
    DisciplineInfo("Геометрия1"),
    DisciplineInfo("Геометрия2"),
    DisciplineInfo("Геометрия3"),
    DisciplineInfo("Геометрия4"),
    DisciplineInfo("Геометрия5"),
    DisciplineInfo("Геометрия6"),
    DisciplineInfo("Геометрия7"),
    DisciplineInfo("Геометрия8"),
    DisciplineInfo("Геометрия9"),
    DisciplineInfo("Геометрия10"),
    DisciplineInfo("Геометрия11"),
    DisciplineInfo("Геометрия12"),
    DisciplineInfo("Геометрия13"),
    DisciplineInfo("Геометрия14"),
    DisciplineInfo("Геометрия15"),
    DisciplineInfo("Геометрия16"),
    DisciplineInfo("Геометрия17"),
    DisciplineInfo("Геометрия18"),
    DisciplineInfo("Геометрия19"),
    DisciplineInfo("Геометрия20"),
    DisciplineInfo("Геометрия21"),
]
