from data_types import *

# test data
audiences_list = [
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "202"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "210"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "204"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "208"),

    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "303"),

    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4309"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4317"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "2103"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "3506"),

    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "303")
]

groups_list = [
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "Соколов Дмитрий Григорьевич", "1"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "Мартынова Вероника Степановна", "2"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "Зеленина Алёна Андреевна", "1"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "Касьянов Глеб Максимович", "3"),
    GroupInfo("ПМ-ПУ", "Программирование и информационные технологии", "Пименова Валерия Дмитриевна", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "Карпов Иван Тимофеевич", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "Пахомова Дарья Тимуровна", "1"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "Исаев Захар Александрович", "3"),
    GroupInfo("ПМ-ПУ", "Прикладная математика и информатика", "Яковлев Артём Максимович", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Касаткина Елизавета Станиславовна", "1"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Попова Ксения Андреевна", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Алексеева Вероника Артёмовна", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Климов Юрий Григорьевич", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Смирнов Иван Даниилович", "3"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Грачев Юрий Макарович", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Горлов Дмитрий Егорович", "4"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Фролов Демид Владиславович", "2"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Лукин Виктор Степанович", "1"),
    GroupInfo("МатМех", "Механика и математическое моделирование", "Нечаев Мирослав Ярославович", "1")

]
