from data_types import *

# test data
audiences_list = [
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "202"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "210"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "204"),
    AudienceInfo("Университетский проспект, дом 35", "Лекционный зал", "208"),

    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 35", "Кабинет", "303"),

    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4309"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "4317"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "2103"),
    AudienceInfo("Университетский проспект, дом 28", "Лекционный зал", "3506"),

    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "215"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "279"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "480"),
    AudienceInfo("Университетский проспект, дом 28", "Кабинет", "303"),
]
